/**
 * Создать классы, спецификации которых приведены ниже.
 * Определить конструкторы и методы setТип(), getТип(), toString().
 * Phone: id, Фамилия, Имя, Отчество, Адрес, Номер телефона, Номер кредитной карточки, Дебет, Кредит,
 * время городских , время междугородных разговоров, трафик интернета
 *
 * Создать интерфейс и его реализацию для выборки данных и вывести эти данные на консоль.
 * a) сведения об абонентах, у которых время внутригородских разговоров превышает заданное;
 * b) сведения об абонентах, которые пользовались междугородной связью;
 * c) сведения об абонентах в алфавитном порядке.
 * д) сведения об первых 10 абонентов у которых самый большой трафик интернета
 */

package HomeWork6;

public class Phone {
    public static void main(String[] args) {


        BusinessLogic work = new BusinessLogic();

        work.add(new Person(1, "Гандзюк", "Дмитрий", "Витальевич", "Богдана Хмельницкого, 28", "+380-68-105-52-21", "7845-9878-2564-3412", 50, 26, 64, 0, 2048));
        work.add(new Person(2, "Грушко", "Александр", "Сергеевич", "Академика Заболотного, 12", "+380-97-116-43-71", "2536-1452-9748-6326", 65.15, 92.14, 0, 250, 1064));
        work.add(new Person(3, "Дробышева-Яница", "Арина", "Руслановна", "Павла Шклярука, 80", "+380-99-309-72-71", "9564-4679-8596-3124", 31.15, 65.27, 1230, 0, 3489));
        work.add(new Person(4, "Енальев", "Иван", "Андреевич", "Багрицкого, 20", "+380-66-352-43-01", "5634-1534-9748-5731", 65.14, 0.00, 97, 65, 1048));
        work.add(new Person(5, "Кекул", "Кирилл", "Александрович", "Вишнёвая, 68", "+380-98-401-69-01", "3164-5623-8754-1223", 31.25, 13.25, 14, 97, 25648));
        work.add(new Person(6, "Колесниченко", "Валентин", "Александрович", "Добровольского, 14", "+380-97-153-16-81", "9584-7362-5148-2635", 12.10, 0.00, 134, 215, 10000));
        work.add(new Person(7, "Мальцев", "Вячеслав", "Сергеевич", "Онежская, 48", "+380-66-490-90-71", "1526-4859-6431-5623", 57.34, 21.10, 220, 31, 6450));
        work.add(new Person(8, "Недева", "Алина", "Алексеевна", "Хуторская, 56", "+380-66-893-40-39", "3467-4859-6431-7946", 31.20, 64.31, 130, 29, 5964));
        work.add(new Person(9, "Овчарук", "Игорь", "Роланович", "Академика Заболотного, 45", "+380-66-502-73-31", "8946-6431-4859-6734", 23.14, 10.10, 25, 350, 0));
        work.add(new Person(10, "Попов", "Алексей", "Русланович", "Новощепной ряд, 11", "+380-96-033-02-21", "5689-7986-1314-2515", 34.12, 13.20, 95, 31, 0));

        work.overTimeInCity();
        work.isTimeOutCity();
        work.alphabetUsers();
        work.biggestTraffic();
    }
}
